// Написать программу вычисления значения функции y=f(a)

double function(double a)
{
   double y=a*a+1;
   return y;
}
double result=function(7);
Console.WriteLine(result);